---
title: Who Are We?
description: A little more about Jerry and Caroline Jones
---

<div class="container flex">
		    <div class="whoweare_image">
        		<img alt="Jerry and Caroline Jones" class="editable" width="659" src="/uploads/a3057c45-0004-4a9b-b744-100f47c59177.jpg" />
        	</div>
			<div class="text editable">
				<p>Jerry and Caroline Jones have been running small group tours to France since 1999.</p>
				<p>Jerry, a Christian minister for over 40 years, was educated at USC and Yale, with further &nbsp;postgraduate studies at Oxford University, England. They met and married in Oxford in 1978. Caroline graduated from the University of Birmingham, UK, with a Bachelor of Law degree.</p>
				<p>After raising their three children in Oxford, the Jones family moved to California, where Caroline became a teacher of French at a &nbsp;local &nbsp;public high school.</p>
				<p>The Joneses have had a home in France since 1992. They are well-known and respected in the local area.</p>
				<p>Passionate about educational travel, Jerry and Caroline have established Summer School France to bring European History, art, architecture and culture to YOU.</p>
				<p><em>Jerry et Caroline Jones organisent des s&eacute;jours en petits groupes en France depuis 1999.</em></p>
				<p><em>Jerry, un ministre chr&eacute;tien pendant plus de 40 ans, a fait ses &eacute;tudes &agrave; l'USC et &agrave; Yale, avec d'autres &eacute;tudes de troisi&egrave;me cycle &agrave; l'Universit&eacute; d'Oxford, en Angleterre. Ils se sont rencontr&eacute;s et se sont mari&eacute;s &agrave; Oxford en 1978.&nbsp;</em></p>
				<p><em>Caroline est dipl&ocirc;m&eacute;e de l'Universit&eacute; de Birmingham, au Royaume-Uni, avec une licence en droit.</em></p>
				<p><em>Apr&egrave;s avoir &eacute;lev&eacute; leurs trois enfants &agrave; Oxford, la famille Jones a d&eacute;m&eacute;nag&eacute; en Californie, o&ugrave; Caroline est devenue enseignante de fran&ccedil;ais dans un lyc&eacute;e public. Caroline est aussi dipl&ocirc;m&eacute;e en l&rsquo;enseignement d'anglais comme&nbsp; langue &eacute;trang&egrave;re.&nbsp;</em></p>
				<p><em>Les Jones ont une maison en France depuis 1992. Ils sont bien connus et int&eacute;gr&eacute;s dans la communaut&eacute;.</em></p>
				<p><em>Passionn&eacute;s par les voyages &eacute;ducatifs, Jerry et Caroline ont cr&eacute;&eacute; Summer School France pour vous faire d&eacute;couvrir l'histoire, l'art, l'architecture et la culture de l'Europe autant que la langue fran&ccedil;aise, et pour les Fran&ccedil;ais, l&rsquo;anglais.&nbsp;</em></p>
			</div>
		</div>
